***** Show Me!

This one-line script will list the daemons running on your system
#+begin_src sh
  ps aux | awk 'NR==1||($1=="root" && $7=="?" && $11 !~ /\[/){print $2, $11}'
#+end_src

#+RESULTS:
|    PID | COMMAND                                  |
|      1 | /sbin/init                               |
|    385 | /lib/systemd/systemd-journald            |
|    419 | /lib/systemd/systemd-udevd               |
|    764 | /usr/lib/accountsservice/accounts-daemon |
|    766 | /usr/sbin/acpid                          |
|    772 | /usr/lib/bluetooth/bluetoothd            |
|    774 | /usr/sbin/cron                           |
|    778 | /usr/sbin/NetworkManager                 |
|    783 | guix-daemon                              |
|    786 | /usr/sbin/irqbalance                     |
|    796 | /usr/bin/python3                         |
|    803 | /usr/lib/policykit-1/polkitd             |
|    813 | /lib/systemd/systemd-logind              |
|    815 | /usr/sbin/thermald                       |
|    820 | /usr/lib/udisks2/udisksd                 |
|    821 | /sbin/wpa_supplicant                     |
|    887 | /usr/sbin/ModemManager                   |
|    974 | sshd:                                    |
|   1110 | /usr/sbin/lightdm                        |
|   1188 | /usr/lib/upower/upowerd                  |
|   1224 | lightdm                                  |
|   1264 | /lib/systemd/systemd                     |
|   1265 | (sd-pam)                                 |
|   1755 | fusermount                               |
|  66169 | sshd:                                    |
| 236151 | /usr/sbin/cupsd                          |
| 236152 | /usr/sbin/cups-browsed                   |

***** How can I learn more?

You can use the =whatis= command to get a 1-line description of most things
#+begin_src sh :results list drawer
  whatis cron
  whatis sshd
  whatis chmod
  whatis whatis
  whatis man
#+end_src

#+RESULTS:
:results:
- cron (8)             - daemon to execute scheduled commands (Vixie Cron)
- sshd (8)             - OpenSSH daemon
- chmod (1)            - change file mode bits
- chmod (2)            - change permissions of a file
- whatis (1)           - display one-line manual page descriptions
- man (7)              - macros to format man pages
- man (1)              - an interface to the system reference manuals
:end:

The online reference manual is divided into 8 sections
#+begin_src sh :results list drawer
  whatis intro | sort
#+end_src

#+RESULTS:
:results:
- intro (1)            - introduction to user commands
- intro (2)            - introduction to system calls
- intro (3)            - introduction to library functions
- intro (4)            - introduction to special files
- intro (5)            - introduction to file formats and filesystems
- intro (6)            - introduction to games
- intro (7)            - introduction to overview and miscellany section
- intro (8)            - introduction to administration and privileged commands
:end:

You can then use the =man= command (with optional -s SECTION-NUMBER) in a
terminal to get to see the reference manual entry on that command:
- =man man= # how to use the =man= command
- =man ssh= # how to use the =ssh= client for the =sshd= server
- =man -s 1= chmod # how to use the =chmod= command
- =man -s 2= chmod # how to use the =chmod= system call

Same commands in Emacs:
- M-x man <ENTER> man <ENTER>
- M-x man <ENTER> ssh <ENTER>
- M-x man <ENTER> ssh(1) <ENTER>
- M-x man <ENTER> ssh(2) <ENTER>

Please note that the /Reference Manual/, which should be available on every
/Posix/ system, is a Reference, /not/ a Tutorial. For Tutorials try searching
the Web.

